const privacyAndPolicy = """
Yusaku Takahashiは、VerooアプリをFreeアプリとして構築しました。本サービスは、高橋優作が無償で提供するものであり、そのまま使用することを前提としています。

本ページは、本サービスを利用される方に、個人情報の収集、利用、開示に関する方針をお知らせするためのものです。

本サービスをご利用になる場合、本ポリシーに基づく情報の収集と利用に同意されたものとします。私が収集する個人情報は、サービスを提供し、改善するために使用されます。私は、このプライバシーポリシーに記載されている場合を除き、誰ともあなたの情報を使用または共有することはありません。

本個人情報保護方針で使用される用語は、本個人情報保護方針で特に定義されない限り、Verooでアクセス可能な当社の利用規約と同じ意味を持ちます。

情報の収集と使用

当社のサービスをご利用いただくにあたり、より良いサービスを提供するために、個人を特定できる情報の提供をお願いする場合があります。私が要求する情報は、お客様のデバイスに保持され、私はいかなる方法でも収集されません。

ログデータ

私は、お客様が私のサービスを利用するたびに、アプリにエラーが発生した場合、私はお客様の携帯電話にログデータと呼ばれるデータと情報を（サードパーティの製品を通じて）収集することをお知らせしたいと思います。このログデータには、お客様の端末のIPアドレス、端末名、オペレーティングシステムのバージョン、私のサービスを利用する際のアプリの設定、お客様がサービスを利用した日時、その他の統計情報などが含まれることがあります。

クッキー（Cookie

クッキーは、一般的に匿名の一意の識別子として使用される少量のデータを含むファイルです。これは、お客様が訪問したウェブサイトからお客様のブラウザに送信され、お客様のデバイスの内部メモリに保存されます。

本サービスでは、この「Cookie」を明示的に使用することはありません。ただし、本アプリでは、情報収集やサービス向上のために、「Cookie」を使用するサードパーティのコードやライブラリを使用する場合があります。お客様は、これらのクッキーを受け入れるか拒否するか、また、お客様のデバイスにクッキーが送信されたときにそれを知ることができるオプションがあります。お客様が当社のクッキーを拒否することを選択した場合、本サービスの一部をご利用いただけない場合があります。

サービス提供者

私は、以下の理由により、第三者の企業や個人を採用することがあります。

当社のサービスを円滑にするため。
当社に代わって本サービスを提供するため。
サービスに関連するサービスを提供するため、または
当社のサービスの利用状況の分析に協力するため。
これらの第三者がユーザーの個人情報にアクセスできることを、本サービスのユーザーにお知らせしたいと思います。その理由は、当社に代わって彼らに割り当てられたタスクを実行するためです。しかし、彼らは他の目的のために情報を開示または使用しないように義務付けられています。

セキュリティ

当社は、個人情報を提供されたお客様の信頼に応え、商業的に利用可能な手段で個人情報を保護するよう努めています。しかし、インターネット上の送信方法、または電子的な保存方法は、100％安全で信頼できるものではなく、その絶対的な安全性を保証することはできませんので、ご注意ください。

他のサイトへのリンク

本サービスには、他のサイトへのリンクが含まれている場合があります。お客様が第三者のリンクをクリックすると、そのサイトへ移動します。これらの外部サイトは、私が運営しているものではないことにご注意ください。従って、これらのウェブサイトのプライバシーポリシーを確認することを強くお勧めします。私は、第三者のサイトやサービスのコンテンツ、プライバシーポリシー、慣行を管理することはできませんし、責任を負うこともありません。

子供のプライバシー

私は、意図的に子どもから個人を特定できる情報を収集することはありません。私は、すべての子供がアプリケーションおよび/またはサービスを通じて個人を特定できる情報を決して送信しないよう奨励します。私は、両親および法定代理人がお子様のインターネット使用を監視し、お子様が許可なくアプリケーションおよび/またはサービスを通じて個人を特定できる情報を提供しないよう指導することで、本ポリシーの施行を支援することを推奨します。お子様が本アプリケーションおよび/または本サービスを通じて個人を特定できる情報を当社に提供したと信じるに足る理由がある場合、当社までご連絡ください。また、お客様の国において、お客様の個人を特定できる情報の処理に同意するには、お客様は16歳以上でなければなりません（国によっては、お客様の親または後見人がお客様に代わって同意することを当社が認める場合があります）。

本プライバシーポリシーの変更

私は、プライバシーポリシーを随時更新することがあります。従って、お客様はこのページを定期的にご覧になり、変更を確認されることをお勧めします。私は、このページに新しいプライバシーポリシーを掲載することにより、変更を通知します。

このポリシーは、2022-04-04より有効となります。

お問い合わせ

私のプライバシーポリシーについてご質問やご提案がありましたら、ご遠慮なく [yusaku.1015@icloud.com](mailto:yusaku.1015@icloud.com) までご連絡ください。

このプライバシーポリシーのページは、privacypolicytemplate.netで作成され、App Privacy Policy Generatorによって修正/生成されました。

[www.DeepL.com/Translator（無料版）で翻訳しました。](http://www.deepl.com/Translator%EF%BC%88%E7%84%A1%E6%96%99%E7%89%88%EF%BC%89%E3%81%A7%E7%BF%BB%E8%A8%B3%E3%81%97%E3%81%BE%E3%81%97%E3%81%9F%E3%80%82)
""";

const termOfService = """
利用規約
Spinner運営局(以下、「当局」)がお客様に提供する「ソーシャルグルメアプリSpinner」(以下、本サービス)は、 Spinner利用規約(以下、本規約)に従って提供される。本規約には、本サービスの提供条件及び当局と登録ユーザーの皆様との間の権利義務関係が定められています。本サービスの利用に際しては、本規約の全文をお読みいただいたうえで、本規約に同意いただく必要があります。Spinnerアカウントを開設し、当局の提供する本サービスの利用を開始することにより、お客様は本規約に有効な同意したものとみなします。

第1条　適用
第2条　定義
第3条　アカウント登録
第4条　利用者資格
第5条　登録事項の変更
第6条　アカウント情報の管理
第7条　禁止事項
第8条　他の利用者との交流
第9条　本サービスの停止等
第10条　権利帰属
第11条　登録抹消等
第12条　退会
第13条　本サービスの内容の変更、終了
第14条　保証の否認及び免責
第15条　秘密保持
第16条　利用者情報の取扱い
第17条　本規約等の変更
第18条　連絡／通知
第19条　サービス利用契約上の地位の譲渡等
第20条　分離可能性
第21条　準拠法及び管轄裁判所

第1条　適用

1. 本規約は、本サービスの提供条件及び本サービスの利用に関する当局と登録ユーザーとの間の権利義務関係を定めることを目的とし、登録ユーザーと当局との間の本サービスの利用に関わる一切の関係に適用されます。
2. 当局が当局ウェブサイト上で掲載する本サービス利用に関するルールは、本規約の一部を構成するものとします。
3. 本規約の内容と、前項のルールその他の本規約外における本サービスの説明等とが異なる場合は、本規約の規定が優先して適用されるものとします。

第2条　定義
本規約において使用する以下の用語は、各々以下に定める意味を有するものとします。
(1) 「サービス利用契約」とは、本規約を契約条件として当局と登録ユーザーの間で締結される、本サービスの利用契約を意味します。
(2) 「知的財産権」とは、著作権、特許権、実用新案権、意匠権、商標権その他の知的財産権（それらの権利を取得し、またはそれらの権利につき登録等を出願する権利を含みます。）を意味します。
(3) 「投稿データ」とは、登録ユーザーが本サービスを利用して投稿その他送信するコンテンツ（文章、画像、動画その他のデータを含みますがこれらに限りません。）を意味します。
(4) 「当局ウェブサイト」とは、そのドメインが「[https://succery.com/](https://succery.com/)」である、当局が運営するウェブサイト（理由の如何を問わず、当局のウェブサイトのドメインまたは内容が変更された場合は、当該変更後のウェブサイトを含みます。）を意味します。
(5) 「登録ユーザー」とは、第3条に基づいて本サービスの利用者としての登録がなされた個人または法人を意味します。
(6) 「本サービス」とは、当局が提供するSpinnerという名称のサービス（理由の如何を問わずサービスの名称または内容が変更された場合は、当該変更後のサービスを含みます。）を意味します。

第3条　アカウント登録

1. 本サービスの利用を希望する者（以下「登録希望者」といいます。）は、本規約を遵守することに同意し、かつ当局の定める一定の情報（以下「登録事項」といいます。）を当局の定める方法で当局に提供することにより、当局に対し、本サービスの利用の登録を申請することができます。
2. 当局は、当局の基準に従って、第1項に基づいて登録申請を行った登録希望者（以下「登録申請者」といいます。）の登録の可否を判断し、当局が登録を認める場合にはその旨を登録申請者に通知します。登録申請者の登録ユーザーとしての登録は、当局が本項の通知を行ったことをもって完了したものとします。
3. 前項に定める登録の完了時に、サービス利用契約が登録ユーザーと当局の間に成立し、登録ユーザーは本サービスを本規約に従い利用することができるようになります。

第4条　利用者資格
当局は、お客様が、以下の各号のいずれかの事由に該当する場合は、登録及び再登録を拒否することがあり、その理由について一切開示義務を負いません。その場合、当該お客様の本サービスの利用を強制退会させることができるものとします。

(1) 当局に提供した登録事項の全部または一部につき虚偽、誤記または記載漏れがあった場合
(2) 未成年者、成年被後見人、被保佐人または被補助人のいずれかであり、法定代理人、後見人、保佐人または補助人の同意等を得ていなかった場合
(3) 反社会的勢力等（暴力団、暴力団員、右翼団体、反社会的勢力、その他これに準ずる者を意味します。以下同じ。）である、または資金提供その他を通じて反社会的勢力等の維持、運営もしくは経営に協力もしくは関与する等反社会的勢力等との何らかの交流もしくは関与を行っていると当局が判断した場合
(4)　　性犯罪、暴力犯罪その他重大な犯罪について有罪判決を受けたことがないこと。いかなる国・地域においても性犯罪者登記簿に性犯罪者としての登録が義務付けられた者ではないこと。
(5) 過去当局との契約に違反した者またはその関係者であると当局が判断した場合
(6) 第9条に定める措置を受けたことがある場合
(7) その他、登録を適当でないと当局が判断した場合

第5条　登録事項の変更
登録ユーザーは、登録事項に変更があった場合、当局の定める方法により当該変更事項を遅滞なく当局に通知するものとします。

第6条　アカウント情報の管理

1. 登録ユーザーは、自己の責任において、本サービスに関するパスワードや及びユーザーID及びメールアドレスを適切に管理及び保管するものとし、これを第三者に利用させ、または貸与、譲渡、名義変更、売買等をしてはならないものとします。
2. パスワードまたはやユーザーID及びメールアドレスの管理不十分、使用上の過誤、第三者の使用等によって生じた損害に関する責任は登録ユーザーが負うものとします。

第7条　禁止事項
登録ユーザーは、本サービスの利用にあたり、以下の各号のいずれかに該当する行為または該当すると当局が判断する行為をしてはなりません。登録ユーザーが以下の各号のいずれかに該当する行為または該当すると当局が判断した場合、登録ユーザーに通知することなく、該当するデータまたはコンテンツを削除するまたはアカウントの停止・永久凍結もしくは強制退会させることがあります。但し、当局は本項の定めにより、当該データの削除等の義務を負うものではなく、各処分に対する説明義務を負うものではありません。

(1) 法令に違反する行為または犯罪行為に関連する行為
(2) 当局、本サービスの他の利用者またはその他の第三者に対する詐欺または脅迫行為
(3) 公序良俗に反する行為
(4) 当局、本サービスの他の利用者またはその他の第三者の知的財産権、肖像権、プライバシーの権利、名誉、その他の権利または利益を侵害する行為
(5) 本サービスを通じ、以下に該当し、または該当すると当局が判断する情報を当局または本サービスの他の利用者に送信すること
・過度に暴力的または残虐な表現を含む情報
・コンピューター・ウィルスその他の有害なコンピューター・プログラムを含む情報
・当局、本サービスの他の利用者またはその他の第三者の名誉または信用を毀損する表現を含む情報
・過度にわいせつな表現を含む情報
・差別を助長する表現を含む情報
・自殺、自傷行為を助長する表現を含む情報
・薬物の不適切な利用を助長する表現を含む情報
・反社会的な表現を含む情報
・他サービスに誘導することを目的とした情報
・何らかの宣伝行為を目的としたコンテンツ情報
・チェーンメール等の第三者への情報の拡散を求める情報
・他人に不快感を与える表現を含む情報
(6) 本サービスのネットワークまたはシステム等に過度な負荷をかける行為
(7) 当局が提供するソフトウェアその他のシステムに対するリバースエンジニアリングその他の解析行為
(8) 本サービスの運営を妨害するおそれのある行為
(9) 当局のネットワークまたはシステム等への不正アクセス
(10) 第三者に成りすます行為
(11) 本サービスの他の利用者のIDまたはパスワードを利用する行為
(12) 当局が事前に許諾しない本サービス上での宣伝、広告、勧誘、または営業行為
(13) 本サービスの他の利用者の情報の収集
(14) 当局、本サービスの他の利用者またはその他の第三者に不利益、損害、不快感を与える行為
(15) 当局ウェブサイト上で掲載する本サービス利用に関するルール（[https://succery.com/spinner/privacy-policy/](https://succery.com/spinner/privacy-policy/)）に抵触する行為
(16) 反社会的勢力等への利益供与
(17)　 18歳未満(高校生を含む)が本サービスの利用登録をする行為及びコンテンツを利用する行為
(18) 　複数アカウントを作成・保持・利用する行為
(19) 　第三者の知的財産権またはその他の権利を侵害する行為及び第三者の著作権、肖像権等の知的財産権または契約上の権利の侵害を誘発する行為
(20) 　本人の性的な好みを投稿する等の行為および肉体関係を目的として本サービスを利用する行為
(21) 　児童ポルノ、またはそれに類する内容、あるいは当局が児童ポルノと類すると判断する内容を掲載する行為
(22) 　利用者間で金銭のやり取りをする行為
(23) 　性器露出画像あるいは性器を描写したデータ等、当局が性器を描写した内容であると判断した内容のサイトへのリンクを掲載する行為
(24) 　他の利用者に対して何らかの宣伝・広告を行う行為や外部サービスへ誘導する行為
(25) 　宗教団体もしくはそれと同視し得る団体への勧誘、布教、寄付等を求める、またはその恐れのある行為
(26) 前各号の行為を直接または間接に惹起し、または容易にする行為
(27) 前各号の行為を試みること
(28) その他、当局が不適切と判断する行為

第8条 　他の利用者との交流
Spinnerは友人と繋がることができるソーシャルグルメアプリであり、お互いが敬意を持ってサービスを利用することを推奨しておりますが、本サービス上または本サービス外でのお客様の行動に対して当局は責任を負いません。本サービス外で連絡を取ったり直接お会いする場合は十分に注意することに同意します。

第9条　本サービスの停止等
当局は、悪質な会員による本利用規約への依願行為を防止する目的等、本サービスの正常かつ健全な運営のために必要な限度で、本サービスへの投稿やメッセージについて、その内容を確認及び削除することがあります。但し、当局がすべてのメッセージ・投稿等を監視する義務を負うものではありません。本規約に違反するコンテンツをサービス上で見つけた場合はこちら([ykaun16@gmail.com](mailto:ykaun16@gmail.com))または本サービスの通報機能を利用してご報告ください。そして、当局は、以下のいずれかに該当する場合には、登録ユーザーに事前に通知することなく、本サービスの全部または一部の提供を停止または中断することができるものとします。
(1) 本サービスに係るコンピューター・システムの点検または保守作業を緊急に行う場合
(2) コンピューター、通信回線等の障害、誤操作、過度なアクセスの集中、不正アクセス、ハッキング等により本サービスの運営ができなくなった場合
(3) 地震、落雷、火災、風水害、停電、天災地変などの不可抗力により本サービスの運営ができなくなった場合
(4) その他、当局が停止または中断を必要と判断した場合

第10条　権利帰属

1. 当局ウェブサイト及び本サービスに関する知的財産権は全て当局または当局にライセンスを許諾している者に帰属しており、本規約に基づく本サービスの利用許諾は、当局ウェブサイトまたは本サービスに関する当局または当局にライセンスを許諾している者の知的財産権の使用許諾を意味するものではありません。
2. 登録ユーザーは、投稿データについて、自らが投稿その他送信することについての適法な権利を有していること、及び投稿データが第三者の権利を侵害していないことについて、当局に対し表明し、保証するものとします。
3. 登録ユーザーは、投稿データについて、当局に対し、世界的、非独占的、無償、サブライセンス可能かつ譲渡可能な使用、複製、配布、派生著作物の作成、表示及び実行に関するライセンスを付与します。また、他の登録ユーザーに対しても、本サービスを利用して登録ユーザーが投稿その他送信した投稿データの使用、複製、配布、派生著作物を作成、表示及び実行することについての非独占的なライセンスを付与します。
4. 登録ユーザーは、当局及び当局から権利を承継しまたは許諾された者に対して著作者人格権を行使しないことに同意するものとします。
5. お客様が発信するコンテンツ、またはお客様が当局に対し本サービスで発信することを承認したコンテンツは、他のユーザーまたはサービスを訪問もしくは参加する人物（他のQlanlyユーザーから共有コンテンツを受け取る可能性のある個人など）から閲覧される可能性があることを、お客様は同意するものとします。
6. 本サービスの一環として、当局がお客様の投稿したコンテンツを監視または審査する場合があることをお客様は理解し同意するものとします。当局は、独自の判断で、本規約に違反する、または本サービスの評判を害するコンテンツの一部または全部を削除することがあります。
7. お客様は当局に対し、関係会社および当局の第三者パートナーが本サービスに広告を掲載できることにお客様は同意するものとします。
8. 当局や本サービスに関するお客様からのご提案やご意見は、報酬の支払いなく、当局があらゆる目的で利用し、共有する場合があることに同意するものとします。

第11条　登録抹消等

1. 当局は、登録ユーザーが、以下の各号のいずれかの事由に該当する場合は、事前に通知または催告することなく、投稿データを削除もしくは非表示にし、当該登録ユーザーについて本サービスの利用を一時的に停止し、または登録ユーザーとしての登録を抹消することができます。
(1) 本規約のいずれかの条項に違反した場合
(2) 登録事項に虚偽の事実があることが判明した場合
(3) 支払停止もしくは支払不能となり、または破産手続開始、民事再生手続開始、会社更生手続開始、特別清算開始若しくはこれらに類する手続の開始の申立てがあった場合
(4) 当局からの問い合わせその他の回答を求める連絡に対して30日間以上応答がない場合
(5) 第4条に該当する場合
(6) その他、当局が本サービスの利用または登録ユーザーとしての登録の継続を適当でないと判断した場合
2. 前項各号のいずれかの事由に該当した場合、登録ユーザーは、当局に対して負っている債務の一切について当然に期限の利益を失い、直ちに当局に対して全ての債務の支払を行わなければなりません。

第12条　退会

1. 登録ユーザーは、本サービスの当局所定の手続の完了により、本サービスから退会し、自己の登録ユーザーとしての登録を抹消することができます。
2. 退会にあたり、当局に対して負っている債務が有る場合は、登録ユーザーは、当局に対して負っている債務の一切について当然に期限の利益を失い、直ちに当局に対して全ての債務の支払を行わなければなりません。
3. 退会後の利用者情報の取扱いについては、第15条の規定に従うものとします。

第13条　本サービスの内容の変更、終了

1. 当局は、当局の都合により、本サービスの内容を変更し、または提供を終了することができます。
2. 当局が本サービスの提供を終了する場合、当局は登録ユーザーに事前に通知するものとします。

第14条　保証の否認及び免責

1. 当局は、本サービスが登録ユーザーの特定の目的に適合すること、期待する機能・商品的価値・正確性・有用性を有すること、登録ユーザーによる本サービスの利用が登録ユーザーに適用のある法令または業界団体の内部規則等に適合すること、継続的に利用できること、及び不具合が生じないことについて、明示又は黙示を問わず何ら保証するものではありません。
2. 当局は、本サービスに関して登録ユーザーが被った損害につき、過去【12ヶ月】間に登録ユーザーが当局に支払った対価の金額を超えて賠償する責任を負わないものとし、また、付随的損害、間接損害、特別損害、将来の損害及び逸失利益にかかる損害については、賠償する責任を負わないものとします。
3. 本サービスまたは当局ウェブサイトに関連して登録ユーザーと他の登録ユーザーまたは第三者との間において生じた取引、連絡、紛争等については、登録ユーザーが自己の責任によって解決するものとします。
4. 当局は、登録ユーザーの犯罪履歴の調査や素行調査を行わないものとします。

第15条　秘密保持
登録ユーザーは、本サービスに関連して当局が登録ユーザーに対して秘密に取扱うことを求めて開示した非公知の情報について、当局の事前の書面による承諾がある場合を除き、秘密に取扱うものとします。

第16条　利用者情報の取扱い

1. 当局による登録ユーザーの利用者情報の取扱いについては、別途当局プライバシーポリシー（[https://succery.com/spinner/privacy-policy/](https://succery.com/spinner/privacy-policy/)）の定めによるものとし、登録ユーザーはこのプライバシーポリシーに従って当局が登録ユーザーの利用者情報を取扱うことについて同意するものとします。
2. 当局は、登録ユーザーが当局に提供した情報、データ等を、個人を特定できない形での統計的な情報として、当局の裁量で、利用及び公開することができるものとし、登録ユーザーはこれに異議を唱えないものとします。

第17条　本規約等の変更
当局は、当局が必要と認めた場合は、本規約を変更できるものとします。本規約を変更する場合、変更後の本規約の施行時期及び内容を当局ウェブサイト上での掲示その他の適切な方法により周知し、または登録ユーザーに通知します。但し、法令上登録ユーザーの同意が必要となるような内容の変更の場合は、当局所定の方法で登録ユーザーの同意を得るものとします。変更が実施された後も引き続き本サービスを利用する場合は、登録ユーザーは改定後の本規約に合意するものとします。

第18条　連絡／通知

1. 本サービスに関する問い合わせその他登録ユーザーから当局に対する連絡または通知、及び本規約の変更に関する通知その他当局から登録ユーザーに対する連絡または通知は、当局の定める方法で行うものとします。
2. 当局が登録事項に含まれるメールアドレスその他の連絡先に連絡または通知を行った場合、登録ユーザーは当該連絡または通知を受領したものとみなします。

第19条　サービス利用契約上の地位の譲渡等

1. 登録ユーザーは、当局の書面による事前の承諾なく、利用契約上の地位または本規約に基づく権利もしくは義務につき、第三者に対し、譲渡、移転、担保設定、その他の処分をすることはできません。
2. 当局は本サービスにかかる事業を他社に譲渡した場合には、当該事業譲渡に伴い利用契約上の地位、本規約に基づく権利及び義務並びに登録ユーザーの登録事項その他の顧客情報を当該事業譲渡の譲受人に譲渡することができるものとし、登録ユーザーは、かかる譲渡につき本項において予め同意したものとします。なお、本項に定める事業譲渡には、通常の事業譲渡のみならず、会社分割その他事業が移転するあらゆる場合を含むものとします。

第20条　分離可能性
本規約のいずれかの条項またはその一部が、消費者契約法その他の法令等により無効または執行不能と判断された場合であっても、本規約の残りの規定及び一部が無効または執行不能と判断された規定の残りの部分は、継続して完全に効力を有するものとします。

第21条　準拠法及び管轄裁判所

1. 本規約及びサービス利用契約の準拠法は日本法とします。
2. 本規約またはサービス利用契約に起因し、または関連する一切の紛争については、東京地方裁判所を第一審の専属的合意管轄裁判所とします。
""";

const universities = [
  '明治大学(和泉)',
  '明治大学(駿河台)',
];

const grades = [
  '1',
  '2',
  '3',
  '4',
];
